## Plans :heavy_multiplication_x:

Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

## Terrateam Plan Output :heavy_multiplication_x:
<details>
  <summary>Expand for plan output details</summary>

<details>
  <summary><h3>Pre Hooks</h3></summary>

**Step**: oidc
**Success**: :thumbsup:
```

```
</details>

<details>
  <summary><h3>Post Hooks</h3></summary>

**Step**: run
**Success**: :heavy_multiplication_x:
**Details**: `conftest test -o table --policy /github/workspace/policies/gcp/compute-instance.rego`
```
Usage:
  conftest test <path> [path [...]] [flags]

Flags:
      --all-namespaces            Test policies found in all namespaces
      --capabilities string       Path to JSON file that can restrict opa functionality against a given policy. Default: all operations allowed
      --combine                   Combine all config files to be evaluated together
  -d, --data strings              A list of paths from which data for the rego policies will be recursively loaded
      --fail-on-warn              Return a non-zero exit code if warnings or errors are found
  -h, --help                      help for test
      --ignore string             A regex pattern which can be used for ignoring paths
      --junit-hide-message        Do not include the violation message in the JUnit test name
  -n, --namespace strings         Test policies in a specific namespace (default [main])
      --no-color                  Disable color when printing
      --no-fail                   Return an exit code of zero even if a policy fails
  -o, --output string             Output format for conftest results - valid options are: [stdout json tap table junit github] (default "stdout")
      --parser string             Parser to use to parse the configurations. Valid parsers: [cue dockerfile edn hcl1 hcl2 hocon ignore ini json jsonnet properties spdx textproto toml vcl xml yaml dotenv]
  -p, --policy strings            Path to the Rego policy files directory (default [policy])
      --proto-file-dirs strings   A list of directories containing Protocol Buffer definitions
      --quiet                     Disable successful test output
      --show-builtin-errors       Collect and return all encountered built-in errors
      --strict                    Enable strict mode for Rego policies
      --suppress-exceptions       Do not include exceptions in output
      --trace                     Enable more verbose trace output for Rego queries
  -u, --update strings            A list of URLs can be provided to the update flag, which will download before the tests run

Global Flags:
  -c, --config-file string   path to configuration file
Error: missing required arguments

```
</details>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_instance.terrateam-in will be created
+   resource "aws_instance" "terrateam-in" {
+       ami                                  = "ami-0e86e20dae9224db8"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "u-24tb1.metal"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = "subnet-02efa144df0a77c13"
+       tags                                 = {
+           "Name" = "TerraTeamInstance"
        }
+       tags_all                             = {
+           "Name" = "TerraTeamInstance"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
